stage2/report/put-wrk-output
Running 5m test @ http://localhost:8080
  16 threads and 16 connections
  Thread calibration: mean lat.: 1.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.313ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.255ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.306ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.252ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.289ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.297ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.267ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.337ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.311ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.305ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.329ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.266ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.268ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.281ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.02ms   13.64ms   1.01s    99.08%
    Req/Sec   330.25     86.55     5.44k    89.96%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.18ms
 75.000%    1.57ms
 90.000%    1.99ms
 99.000%   13.77ms
 99.900%  123.26ms
 99.990%  774.66ms
 99.999%  983.55ms
100.000%    1.01s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.069     0.000000            1         1.00
       0.568     0.100000       145060         1.11
       0.763     0.200000       290395         1.25
       0.921     0.300000       435696         1.43
       1.057     0.400000       580362         1.67
       1.183     0.500000       726030         2.00
       1.247     0.550000       798272         2.22
       1.316     0.600000       870210         2.50
       1.392     0.650000       942819         2.86
       1.477     0.700000      1015523         3.33
       1.572     0.750000      1087633         4.00
       1.624     0.775000      1124129         4.44
       1.680     0.800000      1160388         5.00
       1.741     0.825000      1196385         5.71
       1.809     0.850000      1232825         6.67
       1.888     0.875000      1269053         8.00
       1.933     0.887500      1287075         8.89
       1.985     0.900000      1305063        10.00
       2.047     0.912500      1323340        11.43
       2.121     0.925000      1341330        13.33
       2.217     0.937500      1359359        16.00
       2.281     0.943750      1368542        17.78
       2.369     0.950000      1377536        20.00
       2.515     0.956250      1386561        22.86
       2.805     0.962500      1395600        26.67
       3.311     0.968750      1404672        32.00
       3.685     0.971875      1409188        35.56
       4.215     0.975000      1413727        40.00
       4.995     0.978125      1418252        45.71
       6.207     0.981250      1422787        53.33
       8.127     0.984375      1427319        64.00
       9.319     0.985938      1429583        71.11
      10.615     0.987500      1431843        80.00
      12.311     0.989062      1434115        91.43
      15.135     0.990625      1436371       106.67
      20.559     0.992188      1438642       128.00
      25.023     0.992969      1439770       142.22
      30.671     0.993750      1440906       160.00
      37.375     0.994531      1442039       182.86
      45.471     0.995313      1443168       213.33
      55.871     0.996094      1444301       256.00
      61.311     0.996484      1444869       284.44
      66.943     0.996875      1445435       320.00
      73.663     0.997266      1446002       365.71
      81.983     0.997656      1446570       426.67
      92.479     0.998047      1447133       512.00
      97.535     0.998242      1447420       568.89
     102.783     0.998437      1447699       640.00
     108.927     0.998633      1447983       731.43
     116.287     0.998828      1448268       853.33
     124.095     0.999023      1448551      1024.00
     129.599     0.999121      1448692      1137.78
     135.807     0.999219      1448833      1280.00
     142.207     0.999316      1448973      1462.86
     151.295     0.999414      1449115      1706.67
     168.191     0.999512      1449259      2048.00
     178.047     0.999561      1449327      2275.56
     192.127     0.999609      1449398      2560.00
     213.887     0.999658      1449469      2925.71
     327.423     0.999707      1449540      3413.33
     441.087     0.999756      1449611      4096.00
     496.895     0.999780      1449646      4551.11
     553.471     0.999805      1449681      5120.00
     610.815     0.999829      1449717      5851.43
     667.647     0.999854      1449752      6826.67
     724.479     0.999878      1449788      8192.00
     751.615     0.999890      1449805      9102.22
     780.287     0.999902      1449823     10240.00
     808.959     0.999915      1449841     11702.86
     837.119     0.999927      1449858     13653.33
     865.791     0.999939      1449876     16384.00
     879.615     0.999945      1449885     18204.44
     893.951     0.999951      1449894     20480.00
     908.799     0.999957      1449903     23405.71
     921.599     0.999963      1449911     27306.67
     935.935     0.999969      1449920     32768.00
     943.615     0.999973      1449925     36408.89
     950.271     0.999976      1449929     40960.00
     958.975     0.999979      1449935     46811.43
     964.095     0.999982      1449938     54613.33
     970.751     0.999985      1449942     65536.00
     975.359     0.999986      1449945     72817.78
     978.943     0.999988      1449947     81920.00
     982.527     0.999989      1449949     93622.86
     985.087     0.999991      1449951    109226.67
     989.183     0.999992      1449953    131072.00
     991.231     0.999993      1449955    145635.56
     993.279     0.999994      1449956    163840.00
     995.327     0.999995      1449957    187245.71
     995.839     0.999995      1449958    218453.33
     997.887     0.999996      1449959    262144.00
     999.935     0.999997      1449960    291271.11
     999.935     0.999997      1449960    327680.00
    1001.471     0.999997      1449961    374491.43
    1001.471     0.999998      1449961    436906.67
    1003.519     0.999998      1449962    524288.00
    1003.519     0.999998      1449962    582542.22
    1003.519     0.999998      1449962    655360.00
    1004.543     0.999999      1449963    748982.86
    1004.543     0.999999      1449963    873813.33
    1004.543     0.999999      1449963   1048576.00
    1004.543     0.999999      1449963   1165084.44
    1004.543     0.999999      1449963   1310720.00
    1005.567     0.999999      1449964   1497965.71
    1005.567     1.000000      1449964          inf
#[Mean    =        2.024, StdDeviation   =       13.635]
#[Max     =     1005.056, Total count    =      1449964]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1500008 requests in 5.00m, 95.84MB read
Requests/sec:   5000.03
Transfer/sec:    327.15KB